In [1]:
import pandas as pd

In [43]:
chicago_inspections_csv = "https://raw.githubusercontent.com/paskhaver/pandas-in-action/master/chapter_06_working_with_text_data/chicago_food_inspections.csv"
consumers = "https://raw.githubusercontent.com/paskhaver/pandas-in-action/master/chapter_06_working_with_text_data/customers.csv"

In [3]:
inspections = pd.read_csv(chicago_inspections_csv)

In [4]:
inspections["Name"].head().values

array([' MARRIOT MARQUIS CHICAGO   ', ' JETS PIZZA ', '   ROOM 1520 ',
       '  MARRIOT MARQUIS CHICAGO  ', ' CHARTWELLS   '], dtype=object)

In [5]:
inspections["Name"].str

In [6]:
inspections["Name"].str.lstrip().head()

0    MARRIOT MARQUIS CHICAGO
1                   JETS PIZZA
2                    ROOM 1520
3     MARRIOT MARQUIS CHICAGO
4                 CHARTWELLS
Name: Name, dtype: object

In [7]:
inspections["Name"].str.rstrip().head()

0      MARRIOT MARQUIS CHICAGO
1                   JETS PIZZA
2                    ROOM 1520
3      MARRIOT MARQUIS CHICAGO
4                   CHARTWELLS
Name: Name, dtype: object

In [8]:
inspections["Name"].str.strip().head()

0    MARRIOT MARQUIS CHICAGO
1                 JETS PIZZA
2                  ROOM 1520
3    MARRIOT MARQUIS CHICAGO
4                 CHARTWELLS
Name: Name, dtype: object

In [9]:
inspections["Name"] = inspections["Name"].str.strip()

In [10]:
inspections.tail()

                                Name             Risk
153805                     WOLCOTT'S    Risk 1 (High)
153806  DUNKIN DONUTS/BASKIN-ROBBINS  Risk 2 (Medium)
153807                      Cafe 608    Risk 1 (High)
153808                   mr.daniel's    Risk 1 (High)
153809                    TEMPO CAFE    Risk 1 (High)

In [11]:
inspections.columns

Index(['Name', 'Risk'], dtype='object')

In [12]:
for column in inspections.columns:
    inspections[column] = inspections[column].str.strip()

In [13]:
inspections.head()

                      Name             Risk
0  MARRIOT MARQUIS CHICAGO    Risk 1 (High)
1               JETS PIZZA  Risk 2 (Medium)
2                ROOM 1520     Risk 3 (Low)
3  MARRIOT MARQUIS CHICAGO    Risk 1 (High)
4               CHARTWELLS    Risk 1 (High)

In [14]:
inspections["Name"].str.lower().head()

0    marriot marquis chicago
1                 jets pizza
2                  room 1520
3    marriot marquis chicago
4                 chartwells
Name: Name, dtype: object

In [15]:
inspections["Name"].str.title().head()

0    Marriot Marquis Chicago
1                 Jets Pizza
2                  Room 1520
3    Marriot Marquis Chicago
4                 Chartwells
Name: Name, dtype: object

In [16]:
inspections["Name"].str.capitalize().head()

0    Marriot marquis chicago
1                 Jets pizza
2                  Room 1520
3    Marriot marquis chicago
4                 Chartwells
Name: Name, dtype: object

In [17]:
len(inspections)

153810

In [18]:
inspections["Risk"].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)', 'All', nan],
      dtype=object)

In [19]:
inspections[inspections["Risk"] == "All"]

                                         Name Risk
161                                CHARTWELLS  All
201                           MAKKI MART CORP  All
301                     STONY ISLAND DISCOUNT  All
393                 ROTI MODERN MEDITERRANEAN  All
3142                  RUBIANNA PASTA & THINGS  All
4213                      PIZZA HUT SLICE BAR  All
4677                  BOZII RESTAURANTS CORP.  All
6248                         WENDY CITY TACOS  All
58585                              PQM BAKERY  All
67600   BREWSTONE BEER COMPANY REST & TAPROOM  All
75278                                     OON  All
77525              R N FOOD WINE & SPIRIT INC  All
88627                            Red E Brands  All
94674                      SHAY BOO'S KITCHEN  All
94699                        CONGRESS THEATRE  All
98470                                  SHARKS  All
110718             CHOI'S CHINESE STEAK HOUSE  All
116063                       TIKIM RESTAURANT  All
117170                        CAFE CALIFORNIA  All

In [20]:
inspections[inspections["Risk"].isna()]

                                         Name Risk
291               NEW CHICAGO PAK SWEETS, INC  NaN
323                          GULF OIL OF 63RD  NaN
458                  F & G FOOD AND MEAT INC,  NaN
4237                                   FOOD 1  NaN
4439                           HAM RESTAURANT  NaN
...                                       ...  ...
149509                        JO JO FOOD MART  NaN
149894                            SOCIAL CLUB  NaN
150220                            SOCIAL CLUB  NaN
150909                            SOCIAL CLUB  NaN
151092  UNIVERSITY OF AESTHETICS/TOUCH CLINIC  NaN

[66 rows x 2 columns]

In [21]:
inspections = inspections.dropna(subset=["Risk"])

In [22]:
inspections["Risk"].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)', 'All'],
      dtype=object)

In [23]:
inspections["Risk"] = inspections["Risk"].replace("All", "Risk 4 (Extreme)")

In [24]:
inspections["Risk"].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)',
       'Risk 4 (Extreme)'], dtype=object)

In [25]:
len(inspections)

153744

In [26]:
inspections["Risk"].str.slice(5, 6).head()

0    1
1    2
2    3
3    1
4    1
Name: Risk, dtype: object

In [27]:
inspections["Risk"].str[5:6].head()

0    1
1    2
2    3
3    1
4    1
Name: Risk, dtype: object

In [28]:
inspections["Risk"].str.slice(8).head()

0      High)
1    Medium)
2       Low)
3      High)
4      High)
Name: Risk, dtype: object

In [29]:
# Alternative to slice()
inspections["Risk"].str[8:].head()

0      High)
1    Medium)
2       Low)
3      High)
4      High)
Name: Risk, dtype: object

In [30]:
# This is so cool, I would not have naturally thought about it.
inspections["Risk"].str.slice(8,-1).head()

0      High
1    Medium
2       Low
3      High
4      High
Name: Risk, dtype: object

In [31]:
# Another pythonic alternative to slice()
inspections["Risk"].str[8:-1].head()

0      High
1    Medium
2       Low
3      High
4      High
Name: Risk, dtype: object

In [32]:
# Another alternative that allows chaining, the magic of pandas.
inspections["Risk"].str.slice(8).str.replace(")", "").head()

C:\Users\stapi\AppData\Local\Temp/ipykernel_9428/1980496551.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  inspections["Risk"].str.slice(8).str.replace(")", "").head()

0      High
1    Medium
2       Low
3      High
4      High
Name: Risk, dtype: object

In [33]:
inspections["Name"].str.lower().str.contains("pizza").head()

0    False
1     True
2    False
3    False
4    False
Name: Name, dtype: bool

In [34]:
has_pizza = inspections["Name"].str.lower().str.contains("pizza")

In [35]:
inspections[has_pizza]

                                    Name             Risk
1                             JETS PIZZA  Risk 2 (Medium)
19         NANCY'S HOME OF STUFFED PIZZA    Risk 1 (High)
27            NARY'S GRILL & PIZZA ,INC.    Risk 1 (High)
29                   NARYS GRILL & PIZZA    Risk 1 (High)
68                         COLUTAS PIZZA    Risk 1 (High)
...                                  ...              ...
153756       ANGELO'S STUFFED PIZZA CORP    Risk 1 (High)
153764                COCHIAROS PIZZA #2    Risk 1 (High)
153772  FERNANDO'S MEXICAN GRILL & PIZZA    Risk 1 (High)
153788            REGGIO'S PIZZA EXPRESS    Risk 1 (High)
153801        State Street Pizza Company    Risk 1 (High)

[3992 rows x 2 columns]

In [36]:
inspections["Name"].str.lower().str.startswith("tacos").head()

0    False
1    False
2    False
3    False
4    False
Name: Name, dtype: bool

In [37]:
starts_with_tacos = (
    inspections["Name"].str.lower().str.startswith("tacos")
)

In [38]:
len(starts_with_tacos)

153744

In [39]:
inspections[starts_with_tacos]

                         Name           Risk
69               TACOS NIETOS  Risk 1 (High)
556       TACOS EL TIO 2 INC.  Risk 1 (High)
675          TACOS DON GABINO  Risk 1 (High)
958       TACOS EL TIO 2 INC.  Risk 1 (High)
1036      TACOS EL TIO 2 INC.  Risk 1 (High)
...                       ...            ...
143587          TACOS DE LUNA  Risk 1 (High)
144026           TACOS GARCIA  Risk 1 (High)
146174        Tacos Place's 1  Risk 1 (High)
147810  TACOS MARIO'S LIMITED  Risk 1 (High)
151191            TACOS REYNA  Risk 1 (High)

[105 rows x 2 columns]

In [40]:
ends_with_tacos = (inspections["Name"].str.lower().str.endswith("tacos"))

In [41]:
inspections[ends_with_tacos]

                   Name           Risk
382        LAZO'S TACOS  Risk 1 (High)
569        LAZO'S TACOS  Risk 1 (High)
2652       FLYING TACOS   Risk 3 (Low)
3250       JONY'S TACOS  Risk 1 (High)
3812       PACO'S TACOS  Risk 1 (High)
...                 ...            ...
151121      REYES TACOS  Risk 1 (High)
151318   EL MACHO TACOS  Risk 1 (High)
151801   EL MACHO TACOS  Risk 1 (High)
153087  RAYMOND'S TACOS  Risk 1 (High)
153504        MIS TACOS  Risk 1 (High)

[304 rows x 2 columns]

In [42]:
# stopped at 180/440

# Splitting Strings

In [59]:
customers = pd.read_csv(consumers)
customers.head()

                  Name                                            Address
0        Frank Manning  6461 Quinn Groves, East Matthew, New Hampshire...
1    Elizabeth Johnson  1360 Tracey Ports Apt. 419, Kyleport, Vermont,...
2      Donald Stephens  19120 Fleming Manors, Prestonstad, Montana, 23495
3  Michael Vincent III       441 Olivia Creek, Jimmymouth, Georgia, 82991
4       Jasmine Zamora  4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...

In [60]:
customers["Name"].str.len().head()

0    13
1    17
2    15
3    19
4    14
Name: Name, dtype: int64

In [61]:
customers["Name"].str.split(" ", 1).str.get(0).head()

0        Frank
1    Elizabeth
2       Donald
3      Michael
4      Jasmine
Name: Name, dtype: object

In [62]:
customers["Name"].str.split(" ", 1).str.get(1).head()

0        Manning
1        Johnson
2       Stephens
3    Vincent III
4         Zamora
Name: Name, dtype: object

In [65]:
customers[["First Name", "Last Name"]] = customers["Name"].str.split(pat=" ", n=1, expand=True)

In [66]:
customers

,Name,Address,First Name,Last Name
0,Frank Manning,"6461 Quinn Groves, East Matthew, New Hampshire...",Frank,Manning
1,Elizabeth Johnson,"1360 Tracey Ports Apt. 419, Kyleport, Vermont,...",Elizabeth,Johnson
2,Donald Stephens,"19120 Fleming Manors, Prestonstad, Montana, 23495",Donald,Stephens
3,Michael Vincent III,"441 Olivia Creek, Jimmymouth, Georgia, 82991",Michael,Vincent III
4,Jasmine Zamora,"4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...",Jasmine,Zamora
...,...,...,...,...
9956,Dana Browning,"762 Andrew Views Apt. 254, North Paul, New Mex...",Dana,Browning
9957,Amanda Anderson,"44188 Day Crest Apt. 901, Lake Marcia, Maine, ...",Amanda,Anderson
9958,Eric Davis,"73015 Michelle Squares, Watsonville, West Virg...",Eric,Davis
9959,Taylor Hernandez,"129 Keith Greens, Haleyfurt, Oklahoma, 98916",Taylor,Hernandez
9960,Sherry Nicholson,"355 Griffin Valley, Davidtown, New Mexico, 17581",Sherry,Nicholson

In [70]:
customers = customers.drop(columns=["Name"])

In [72]:
customers.head()

                                             Address First Name    Last Name
0  6461 Quinn Groves, East Matthew, New Hampshire...      Frank      Manning
1  1360 Tracey Ports Apt. 419, Kyleport, Vermont,...  Elizabeth      Johnson
2  19120 Fleming Manors, Prestonstad, Montana, 23495     Donald     Stephens
3       441 Olivia Creek, Jimmymouth, Georgia, 82991    Michael  Vincent III
4  4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...    Jasmine       Zamora

In [75]:
customers["Address"].loc[0]

'6461 Quinn Groves, East Matthew, New Hampshire, 16656'

In [81]:
customers[["Street", "City", "State", "Zip"]] = customers["Address"].str.split(pat=",", expand=True)

In [85]:
customers = customers.drop(columns=["Address"])

In [86]:
customers.head()

,First Name,Last Name,Street,City,State,Zip
0,Frank,Manning,6461 Quinn Groves,East Matthew,New Hampshire,16656
1,Elizabeth,Johnson,1360 Tracey Ports Apt. 419,Kyleport,Vermont,31924
2,Donald,Stephens,19120 Fleming Manors,Prestonstad,Montana,23495
3,Michael,Vincent III,441 Olivia Creek,Jimmymouth,Georgia,82991
4,Jasmine,Zamora,4246 Chelsey Ford Apt. 310,Karamouth,Utah,76252

In [87]:
customers.tail()

,First Name,Last Name,Street,City,State,Zip
9956,Dana,Browning,762 Andrew Views Apt. 254,North Paul,New Mexico,28889
9957,Amanda,Anderson,44188 Day Crest Apt. 901,Lake Marcia,Maine,37378
9958,Eric,Davis,73015 Michelle Squares,Watsonville,West Virginia,03933
9959,Taylor,Hernandez,129 Keith Greens,Haleyfurt,Oklahoma,98916
9960,Sherry,Nicholson,355 Griffin Valley,Davidtown,New Mexico,17581

In [88]:
customers["Street"].head()

0             6461 Quinn Groves
1    1360 Tracey Ports Apt. 419
2          19120 Fleming Manors
3              441 Olivia Creek
4    4246 Chelsey Ford Apt. 310
Name: Street, dtype: object

In [89]:
customers["Street"].str.replace("\d{4,}", "*", regex=True).head()

0             * Quinn Groves
1    * Tracey Ports Apt. 419
2           * Fleming Manors
3           441 Olivia Creek
4    * Chelsey Ford Apt. 310
Name: Street, dtype: object